# Pandas

Pandas is a package used for managing data.

Pandas main use is that it creates 2 new data types for storing data: series and dataframe.

Think of a pandas dataframe like an excel spreadsheet that is storing some data.  One column can have customer name, one column can have product sold name, another column can have price or quantity... Then the rows could be individual sales.

A dataframe is made up of several series.  Each column of a dataframe is a series.

We can name each column and row of a dataframe.

A pandas dataframe is very similar to a data.frame in R.

Similar to numpy arrays, a dataframe is a more robust data type for storing data than lists of lists. Dataframes are more flexible than numpy arrays.

A numpy array can create a matrix with all entries of the same data type.  In a dataframe each column can have its own datatype.  

That's not to say numpy arrays aren't useful.  It is often easiest to convert some subset of a dataframe to a numpy array and then use that to do some math.

Pandas also has SQL-like functions for merging, joining, and sorting dataframes.

In [2]:
import pandas as pd
import numpy as np  # numpy is not necessary for pandas, but we will use some np code in this example
# in general it's good practice to import all pacakages at the beginning

In [3]:
# first let's look at series - think of this as a single column of a spreadsheet
# each entry in a series corresponds to an individual row in the spreadsheet
# we can create a series by converting a list, or numpy array

mylist = [5.4,6.1,1.7,99.8]
myarray = np.array(mylist)

In [4]:
myseries1 = pd.Series(data=mylist)
print(myseries1)
myseries2 = pd.Series(myarray)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [5]:
# we access individual entries the same way as with lists and arrays
print(myseries1[2])

1.7

In [6]:
# we can add labels to the entries of a series

mylabels = ['first','second','third','fourth']
myseries3 = pd.Series(data=mylist,index=mylabels)
print(myseries3)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [7]:
# we need not be explicit about the entries of pd.Series
myseries4 = pd.Series(mylist,mylabels)
print(myseries4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [8]:
# we can also access entries using the index labels
print(myseries4['second'])

6.1

In [9]:
# we can do math on series 
myseries5 = pd.Series([5.5,1.1,8.8,1.6],['first','third','fourth','fifth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.5
third     1.1
fourth    8.8
fifth     1.6
dtype: float64

fifth       NaN
first      10.9
fourth    108.6
second      NaN
third       2.8
dtype: float64

In [10]:
# we can combine series to create a dataframe using the concat function
df1 = pd.concat([myseries4,myseries5],axis=1,sort=False)
df1

           0    1
first    5.4  5.5
second   6.1  NaN
third    1.7  1.1
fourth  99.8  8.8
fifth    NaN  1.6

In [11]:
# we can create a new dataframe 
df2 = pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0 -0.773598  0.387023 -0.334080  0.103327  0.225815
1 -0.289228  0.167665 -0.097250 -0.030514  0.301340
2 -0.080121 -1.121529 -1.027969 -0.030476 -0.458739
3 -0.065842  1.386941 -1.954756 -0.411992 -1.350456
4 -0.617469  1.800370 -0.900961 -0.138738  0.730166

In [26]:
# lets give labels to rows and columns
df3 = pd.DataFrame(np.random.randn(5,5),index=['first row','second row','third row','fourth row','fifth row'],
                   columns=['first col','second col','third col','fourth col','fifth col'])
df3

            first col  second col  third col  fourth col  fifth col
first row    1.564998    0.158447   0.725700   -0.791013   0.129548
second row  -0.388217   -1.802826   0.960659   -0.784890  -0.635561
third row    0.403489    0.072956  -2.052026    1.000030  -2.065211
fourth row   0.445357   -0.638435   0.674216    0.761800  -0.163938
fifth row    0.837250   -0.358226   0.084358   -0.907232   0.064791

In [27]:
# we can access individual series in a data frame
print(df3['second col'])
print('')
df3[['third col','first col']]

first row     0.158447
second row   -1.802826
third row     0.072956
fourth row   -0.638435
fifth row    -0.358226
Name: second col, dtype: float64

            third col  first col
first row    0.725700   1.564998
second row   0.960659  -0.388217
third row   -2.052026   0.403489
fourth row   0.674216   0.445357
fifth row    0.084358   0.837250

In [28]:
# we can access rows of a dataframe
df3.loc['fourth row']

first col     0.445357
second col   -0.638435
third col     0.674216
fourth col    0.761800
fifth col    -0.163938
Name: fourth row, dtype: float64

In [29]:
df3.iloc[2]

first col     0.403489
second col    0.072956
third col    -2.052026
fourth col    1.000030
fifth col    -2.065211
Name: third row, dtype: float64

In [30]:
df3.loc[['fourth row','first row'],['second col','third col']]

            second col  third col
fourth row   -0.638435   0.674216
first row     0.158447   0.725700

In [31]:
# we can use logical indexing for dataframes just like for numpy arrays
df3>0

            first col  second col  third col  fourth col  fifth col
first row        True        True       True       False       True
second row      False       False       True       False      False
third row        True        True      False        True      False
fourth row       True       False       True        True      False
fifth row        True       False       True       False       True

In [32]:
print(df3[df3>0])

            first col  second col  third col  fourth col  fifth col
first row    1.564998    0.158447   0.725700         NaN   0.129548
second row        NaN         NaN   0.960659         NaN        NaN
third row    0.403489    0.072956        NaN     1.00003        NaN
fourth row   0.445357         NaN   0.674216     0.76180        NaN
fifth row    0.837250         NaN   0.084358         NaN   0.064791

In [33]:
# we can add columns to a dataframe
df3['sixth col'] = np.random.randn(5,1)
df3

            first col  second col  third col  fourth col  fifth col  sixth col
first row    1.564998    0.158447   0.725700   -0.791013   0.129548  -0.547653
second row  -0.388217   -1.802826   0.960659   -0.784890  -0.635561   0.940601
third row    0.403489    0.072956  -2.052026    1.000030  -2.065211  -1.342397
fourth row   0.445357   -0.638435   0.674216    0.761800  -0.163938  -1.664500
fifth row    0.837250   -0.358226   0.084358   -0.907232   0.064791  -1.029434

In [21]:
# we can remove columns or rows from a dataframe
df3.drop('first col',axis=1,inplace=True)

In [22]:
df3

            second col  third col  fourth col  fifth col  sixth col
first row    -0.393213  -1.281659    0.625961   0.229153   1.603142
second row   -0.171173  -1.836014    0.630837  -1.718634  -0.020544
third row    -0.123574  -2.387980    0.931491   1.595252  -0.385111
fourth row    1.702887   1.176554    0.224104   0.284045   1.048365
fifth row    -1.655162  -1.473863    1.493430  -1.108457   0.830211

In [34]:
df4 = df3.drop('first col',axis=1)
df4

            second col  third col  fourth col  fifth col  sixth col
first row     0.158447   0.725700   -0.791013   0.129548  -0.547653
second row   -1.802826   0.960659   -0.784890  -0.635561   0.940601
third row     0.072956  -2.052026    1.000030  -2.065211  -1.342397
fourth row   -0.638435   0.674216    0.761800  -0.163938  -1.664500
fifth row    -0.358226   0.084358   -0.907232   0.064791  -1.029434

In [35]:
df5 = df3.drop('second row',axis=0)
df5

            first col  second col  third col  fourth col  fifth col  sixth col
first row    1.564998    0.158447   0.725700   -0.791013   0.129548  -0.547653
third row    0.403489    0.072956  -2.052026    1.000030  -2.065211  -1.342397
fourth row   0.445357   -0.638435   0.674216    0.761800  -0.163938  -1.664500
fifth row    0.837250   -0.358226   0.084358   -0.907232   0.064791  -1.029434

In [36]:
# we can remove a dataframe's index labels
df5.reset_index()

,index,first col,second col,third col,fourth col,fifth col,sixth col
0,first row,1.564998,0.158447,0.725700,-0.791013,0.129548,-0.547653
1,third row,0.403489,0.072956,-2.052026,1.000030,-2.065211,-1.342397
2,fourth row,0.445357,-0.638435,0.674216,0.761800,-0.163938,-1.664500
3,fifth row,0.837250,-0.358226,0.084358,-0.907232,0.064791,-1.029434

In [37]:
df5

            first col  second col  third col  fourth col  fifth col  sixth col
first row    1.564998    0.158447   0.725700   -0.791013   0.129548  -0.547653
third row    0.403489    0.072956  -2.052026    1.000030  -2.065211  -1.342397
fourth row   0.445357   -0.638435   0.674216    0.761800  -0.163938  -1.664500
fifth row    0.837250   -0.358226   0.084358   -0.907232   0.064791  -1.029434

In [38]:
df5.reset_index(inplace=True)
df5

,index,first col,second col,third col,fourth col,fifth col,sixth col
0,first row,1.564998,0.158447,0.725700,-0.791013,0.129548,-0.547653
1,third row,0.403489,0.072956,-2.052026,1.000030,-2.065211,-1.342397
2,fourth row,0.445357,-0.638435,0.674216,0.761800,-0.163938,-1.664500
3,fifth row,0.837250,-0.358226,0.084358,-0.907232,0.064791,-1.029434

In [39]:
# we can assign new names to the index
df5['new name'] = ['This','is','the','row']
df5

,index,first col,second col,third col,fourth col,fifth col,sixth col,new name
0,first row,1.564998,0.158447,0.725700,-0.791013,0.129548,-0.547653,This
1,third row,0.403489,0.072956,-2.052026,1.000030,-2.065211,-1.342397,is
2,fourth row,0.445357,-0.638435,0.674216,0.761800,-0.163938,-1.664500,the
3,fifth row,0.837250,-0.358226,0.084358,-0.907232,0.064791,-1.029434,row

In [40]:
df5.set_index('new name',inplace=True)
df5

,index,first col,second col,third col,fourth col,fifth col,sixth col
new name,,,,,,,
This,first row,1.564998,0.158447,0.725700,-0.791013,0.129548,-0.547653
is,third row,0.403489,0.072956,-2.052026,1.000030,-2.065211,-1.342397
the,fourth row,0.445357,-0.638435,0.674216,0.761800,-0.163938,-1.664500
row,fifth row,0.837250,-0.358226,0.084358,-0.907232,0.064791,-1.029434

# Combining data frames

The ways dataframes are combined in pandas is similar to SQL

We will examine 3 methods for combining dataframes

1. concat
2. join
3. merge

In [41]:


df7 = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df8 = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

In [42]:
pd.concat([df7,df8],axis=0,sort=False)

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
4      101      NaN       NaN    123  yellow      12.0
5      103      NaN       NaN    214   green       9.0
6      104      NaN       NaN    663   green      44.0
7      105      NaN       NaN    331    blue      21.0

In [43]:
pd.concat([df7,df8],axis=0,sort=True)

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
4      NaN  yellow      101      12.0       NaN    123
5      NaN   green      103       9.0       NaN    214
6      NaN   green      104      44.0       NaN    663
7      NaN    blue      105      21.0       NaN    331

In [44]:
pd.concat([df7,df8],axis=1,sort=False)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

# Merge and Join

Merge combines dataframes using a column's values to identify common entries

Join combines dataframes using the index to identify common entries

In [45]:
pd.merge(df7,df8,how='outer',on='customer') # outer merge is union of on

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow      12.0    123.0
1      102     cat2        no     52.0     NaN       NaN      NaN
2      103     cat1       yes    214.0   green       9.0    214.0
3      104     cat3       yes    663.0   green      44.0    663.0
4      105      NaN       NaN      NaN    blue      21.0    331.0

In [46]:
pd.merge(df7,df8,how='inner',on='customer') # inner merge is intersection of on

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow        12      123
1      103     cat1       yes      214   green         9      214
2      104     cat3       yes      663   green        44      663

In [47]:
pd.merge(df7,df8,how='right',on='customer') # left merge is just first on, but all columns ... right is second

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow        12      123
1      103     cat1       yes    214.0   green         9      214
2      104     cat3       yes    663.0   green        44      663
3      105      NaN       NaN      NaN    blue        21      331

In [48]:
df9 = pd.DataFrame({'Q1': [101,102,103],
                    'Q2': [201,202,203]},
                   index=['I0','I1','I2'])

df10 = pd.DataFrame({'Q3': [301,302,303],
                    'Q4': [401,402,403]},
                   index=['I0','I2','I3'])

In [49]:
# join behaves just like merge, 
# except instead of using the values of one of the columns 
# to combine data frames, it uses the index labels
df9.join(df10,how='right') # outer, inner, left, and right work the same as merge

       Q1     Q2   Q3   Q4
I0  101.0  201.0  301  401
I2  103.0  203.0  302  402
I3    NaN    NaN  303  403

In [50]:
# let's now go over a few more basic functialities of pandas

df8['color'].unique()

array(['yellow', 'green', 'blue'], dtype=object)

In [51]:
df8['color'].value_counts()

green     2
yellow    1
blue      1
Name: color, dtype: int64

In [52]:
df9.mean()

Q1    102.0
Q2    202.0
dtype: float64

In [53]:
df8.columns

Index(['customer', 'color', 'distance', 'sales'], dtype='object')

In [54]:
df8

  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [55]:
new_df = df8[(df8['customer']!='105') & (df8['color']!='green')]
new_df

  customer   color  distance  sales
4      101  yellow        12    123

In [56]:
print(df8['sales'].sum())
print(df8['distance'].min())

1331
9

In [57]:
def profit(s):
    return s*0.5 # 50% markup...

In [58]:
df8['sales'].apply(profit)

4     61.5
5    107.0
6    331.5
7    165.5
Name: sales, dtype: float64

In [59]:
df8['color'].apply(len)

4    6
5    5
6    5
7    4
Name: color, dtype: int64

In [60]:
df11 = df8[['distance','sales']]
df11.applymap(profit)

   distance  sales
4       6.0   61.5
5       4.5  107.0
6      22.0  331.5
7      10.5  165.5

In [61]:
def col_sum(co):
    return sum(co)
df11.apply(col_sum)

distance      86
sales       1331
dtype: int64

In [ ]:
df11.applymap(col_sum)

In [63]:
del df8['color']
df8

  customer  distance  sales
4      101        12    123
5      103         9    214
6      104        44    663
7      105        21    331

In [64]:
df8.index

Int64Index([4, 5, 6, 7], dtype='int64')

In [65]:
df8.sort_values(by='distance',inplace=True)
df8

  customer  distance  sales
5      103         9    214
4      101        12    123
7      105        21    331
6      104        44    663

In [66]:
df8

  customer  distance  sales
5      103         9    214
4      101        12    123
7      105        21    331
6      104        44    663

In [67]:
# if some series has multiple of the same value then we can group all the unique entries together
mydict = {'customer': ['Customer 1','Customer 1','Customer2','Customer2','Customer3','Customer3'], 
          'product1': [1.1,2.1,3.8,4.2,5.5,6.9],
          'product2': [8.2,9.1,11.1,5.2,44.66,983]}
df6 = pd.DataFrame(mydict,index=['Purchase 1','Purchase 2','Purchase 3','Purchase 4','Purchase 5','Purchase 6'])
df6

              customer  product1  product2
Purchase 1  Customer 1       1.1      8.20
Purchase 2  Customer 1       2.1      9.10
Purchase 3   Customer2       3.8     11.10
Purchase 4   Customer2       4.2      5.20
Purchase 5   Customer3       5.5     44.66
Purchase 6   Customer3       6.9    983.00

In [68]:
grouped_data = df6.groupby('customer')
print(grouped_data)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fc5154b4820>

In [70]:
grouped_data.std()

            product1    product2
customer
Customer 1  0.707107    0.636396
Customer2   0.282843    4.171930
Customer3   0.989949  663.506577

In [71]:
grouped_data.des

AttributeError: 'DataFrameGroupBy' object has no attribute 'info'

In [ ]:
df8

In [ ]:
# similar to numpy arrays, we can also save and load dataframes to csv files, and also Excel files

df8.to_csv('df8.csv',index=True)

In [ ]:
new_df8 = pd.read_csv('df8.csv',index_col=0)
new_df8

In [ ]:
df8.to_excel('df8.xlsx',index=False,sheet_name='first sheet')
newer_df8 = pd.read_excel('df8.xlsx',sheet_name='first sheet',index_col=1)
newer_df8